package utils

func RemovePosFilter() []string {
	return []string{"助詞", "記号"}
}

func NotCooccurrencesFilter() []string {
	return []string{
		// 記号
		"「",
		"」",
		"[",
		"]",
		"[[",
		"]]",
		"[[（",
		"）]]",
		"【",
		"】",
		"'''",
		"{{",
		"}}",
		"|",
		":",
		"&",
		"-",
		"=",
		".",
		"*",
		"://",
		"/",
		"_",
		"「[[",
		")|",
		"===",
		"==",
		"%",
		"||",
		"#",
		"（[[",
		"'''」",
		"]]』（{{",
		"}}}}",
		"(",
		")]]",
		"〜",
		"-]]",
		"!!",
		")",
		"'''（{{",
		"<",
		"\"",
		"=\"",
		"\">",
		// 意味のない言葉
		"れれ",
		"でし",
		// 意味のない動詞
		"する",
		"いる",
		"れる",
		"あり",
		"ある",
		"よう",
		"です",
		"言う",
		// SEO対策ワード
		"おすすめ",
		"ランキング",
		"選",
		"選ぶ",
		"人気",
		"選び方",
		// 広すぎる言葉
		"人",
		"国",
	}
}

func RemoveRgx() []string {
	return []string{
		`^\p{Hiragana}$`, // ひらがな１文字を除外
		`^\p{Katakana}$`, // カタカナ1文字を除外
		`[a-zA-Z]`,       // アルファベットのみを除外
		`[0-9]`,          // 数字のみを除外
	}
}
